posts/tossconf2025.html
<!DOCTYPE html><html><head><!-- 2025-08-03 --><!-- 2026-01-28 Wed 15:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>TossConf 2025</title>
<meta name="generator" content="Org Mode" />
<link href="https://fonts.cdnfonts.com/css/share-tech-mono" rel="stylesheet"><link rel="stylesheet" type="text/css" href="/assets/code.css"/><link rel="stylesheet" type="text/css" href="/assets/style.css"/>
</head><body><header><div class="container"><h1>Gold Ayan's Tinker Garage</h1></div><div class="header-content"><nav class="container"><ul class="topnav"><li><a href="/index.html">Home</a></li><li><a href="/projects.html">Projects</a></li><li><a href="/posts">Posts</a></li><li><a href="/til.html">TIL</a></li><li><a href="/blogrolls.html">Blogrolls</a></li><li><a href="/feed.xml">RSS</a></li></ul></nav></div></header><article class="container"><div class="blog-content"><p>
This year, I got an opportunity to be a volunteer at the JSLover conference
which helped me a lot for TOSSConf 2025 preparation, as well as last
year SFD(Software Freedom Day) 2024 event.
</p>

<p>
KanchiLug volunteers, Pailagam Institute and St.joseph students are
The reasons we can successfully hold this conference with great
success.
</p>

<p>
<del>I</del> We implemented a lot of things at the conference
</p>
<ul class="org-ul">
<li>Two separate tracks for both the Workshop and talks</li>
<li>Stalls</li>
<li>Dhuruvangal book for speakers</li>
<li>A5 Stickers sheet (stole the idea from JSLover conference)</li>
</ul>

<p>
Each of the above tasks comes with its own set of issues, but with
Volunteers, we can finalise the details before the conference starts.
</p>

<div id="outline-container-org8527b17" class="outline-2">
<h2 id="org8527b17">Workshop</h2>
<div class="outline-text-2" id="text-org8527b17">
<ul class="org-ul">
<li>Self-hosting workshop
<ul class="org-ul">
<li>It went great. The only thing I regret is that we are only able to cover Jellyfin.</li>
</ul></li>
<li>Clojure
<ul class="org-ul">
<li>This workshop is not only about programming language but about a thought process.</li>
<li>How to approach the problem.</li>
<li>Functional paradigms that we can utilise in other programming languages.</li>
<li>Finally, I got another reason to solve problems in Clojure.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org0d13967" class="outline-2">
<h2 id="org0d13967">Talks</h2>
<div class="outline-text-2" id="text-org0d13967">
<ul class="org-ul">
<li>I was in Track 2, so I only got to listen to things that are happening there.</li>
<li>Demystifying Artificial Intelligence: A Beginner’s Guide to Smart Machines
<ul class="org-ul">
<li>Dr. U. Sabura Banu gave this talk.</li>
<li>How to solve problems around us using simple devices and tools.</li>
<li>Examples given by the mam are very interesting.</li>
</ul></li>
<li>Dissect, Build Network packets
<ul class="org-ul">
<li>Rengaraj, one of the organisers of chennaipy community, gave this talk.</li>
<li>Scapy is an excellent tool. He demonstrated what we can do with this.</li>
</ul></li>
<li>A day in the open source world
<ul class="org-ul">
<li>Bowrna Prabhakaran gave this talk.</li>
<li>Impressed by her story and phonetic search support for the Tamil story</li>
<li>I think we can use this to create a cheap autosuggestion for the editor
<ul class="org-ul">
<li>If anyone is interested, ping me.</li>
</ul></li>
</ul></li>
<li>Speed It Up! Building Efficient Indexes in MongoDB
<ul class="org-ul">
<li>Naveen Kumar gave this talk.</li>
<li>He went all out with this talk.</li>
<li>I never thought talking about indexes would be this interesting.</li>
<li>Interactive Quiz using Open source tool at the end is super cool.
<ul class="org-ul">
<li>tool: <a href="https://classquiz.de/">https://classquiz.de/</a></li>
</ul></li>
</ul></li>
<li>Building Web with Batteries Included.
<ul class="org-ul">
<li>Namma Hari gave this talk, FossUnited organiser</li>
<li>He gave a demo about creating a website on <a href="https://frappe.io/">https://frappe.io/</a></li>
<li>I can't explain this software in words, damn this thing is crazy.</li>
<li>Building SAS software in minutes is mind-blowing.</li>
<li>Dhanasekar, the previous ilugc co-ordinator, gave a demo about this in
Kanchilug but Hari took it to the next level.</li>
<li>He asked if the crowd is not big, we can do a workshop. Wish I had said yes to him.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgfd706c8" class="outline-2">
<h2 id="orgfd706c8">Conference</h2>
<div class="outline-text-2" id="text-orgfd706c8">
</div>
<div id="outline-container-org7516584" class="outline-3">
<h3 id="org7516584">Pros</h3>
<div class="outline-text-3" id="text-org7516584">
<ul class="org-ul">
<li>Met a lot of old and new friends at this conference.</li>
<li>Stickers
<ul class="org-ul">
<li>we decided which sticker to print so got firefox, vlc, blender, ..</li>
<li>Also tons of sticker from stalls but not able to get few.</li>
<li>My laptop has no room for stickers now.</li>
</ul></li>
<li>Got my own hard copy of the book Dhuruvangal.
<ul class="org-ul">
<li>Gave my copy to my college friend to read.</li>
</ul></li>
<li>Invited my brothers for this event, they too enjoyed the event.</li>
<li>Conducted Selfhosting workshop with salman over a huge crowd (I never did that before :p).
<ul class="org-ul">
<li>Conducting workshop with more than one member helps us identify and address the issue properly.</li>
<li>So next time i am doing workshop i plan on doing it with more people.</li>
<li>It also help us with crowd control and resolve their problems quickly.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org886c9d0" class="outline-3">
<h3 id="org886c9d0">Cons</h3>
<div class="outline-text-3" id="text-org886c9d0">
<ul class="org-ul">
<li>Not able to attend few talks
<ul class="org-ul">
<li>As i was handling one of the track i am not able to listen to talks that are happening in other track.</li>
</ul></li>
<li>Only had a few time to roam around the stall so i took bunch of photo but not able to talk to lot of them.</li>
<li>Day 2 was more tough, i missed meeting few people who came to the conference.</li>
<li>I felt the crowd control was bit off now and then but worked out in the end.</li>
<li>Sometimes we felt we have fewer volunteers, especially during lunch.</li>
</ul>

<p>
Overall i learned a lot and i am honoured that i get to take part in
Tamil Nadu's only Tamil based Open Source conferenece.
</p>
</div>
</div>
</div>
</div></article><footer>This site is made with ❤️ using Emacs.</footer></body></html>
